In [1]:
import pandas as pd
import numpy as np

# PART 1

In [2]:
df = pd.read_csv('nba.csv')

In [3]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [5]:
df.shape

(458, 9)

In [6]:
df.isna().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [7]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [8]:
df['College'].mode()

0    Kentucky
Name: College, dtype: object

In [9]:
df['College'].value_counts()

Kentucky           22
Duke               20
Kansas             18
North Carolina     16
UCLA               15
                   ..
Utah Valley         1
Cleveland State     1
Iowa State          1
Florida State       1
Baylor              1
Name: College, Length: 118, dtype: int64

In [10]:
df['Salary'].mean()

4842684.105381166

In [11]:
df['Age'].value_counts()

24.0    47
25.0    45
27.0    41
23.0    41
26.0    36
28.0    31
30.0    31
29.0    28
22.0    26
31.0    22
20.0    19
21.0    19
33.0    14
32.0    13
34.0    10
36.0    10
35.0     9
37.0     4
38.0     4
40.0     3
39.0     2
19.0     2
Name: Age, dtype: int64

In [12]:
df.groupby(['College'])['Salary'].mean()

College
Alabama             1.421686e+06
Arizona             3.325948e+06
Arizona State       7.933941e+06
Arkansas            2.713180e+06
Baylor              9.813480e+05
                        ...
Western Michigan    8.450590e+05
Wichita State       8.450590e+05
Wisconsin           1.974492e+06
Wyoming             1.155600e+06
Xavier              1.499187e+06
Name: Salary, Length: 118, dtype: float64

In [13]:
g = df.groupby(['Age','Salary'])
g.first()

                          Name                    Team  Number Position  \
Age  Salary
19.0 1733040.0   Rashad Vaughn         Milwaukee Bucks    20.0       SG
     2127840.0    Devin Booker            Phoenix Suns     1.0       SG
20.0 525093.0   Christian Wood      Philadelphia 76ers    35.0       PF
     1131960.0    Kevon Looney   Golden State Warriors    36.0       SF
     1282080.0      Tyus Jones  Minnesota Timberwolves     1.0       PG
...                        ...                     ...     ...      ...
39.0 947726.0   Pablo Prigioni    Los Angeles Clippers     9.0       PG
     4088019.0    Vince Carter       Memphis Grizzlies    15.0       SG
40.0 250750.0     Andre Miller       San Antonio Spurs    24.0       PG
     5250000.0      Tim Duncan       San Antonio Spurs    21.0        C
     8500000.0   Kevin Garnett  Minnesota Timberwolves    21.0       PF

               Height  Weight         College
Age  Salary
19.0 1733040.0    6-6   202.0            UNLV
     2127840.0    6-6   206.0        Kentucky
20.0 525093.0    6-11   220.0            UNLV
     1131960.0    6-9   220.0            UCLA
     1282080.0    6-2   195.0            Duke
...               ...     ...             ...
39.0 947726.0     6-3   185.0            None
     4088019.0    6-6   220.0  North Carolina
40.0 250750.0     6-3   200.0            Utah
     5250000.0   6-11   250.0     Wake Forest
     8500000.0   6-11   240.0            None

[393 rows x 7 columns]

# PART 2

In [14]:
df2 = pd.read_csv('IRIS.csv')

In [15]:
df2.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [16]:
df2.shape

(150, 5)

In [17]:
df2.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [18]:
df2.isna().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [19]:
df2['species'].value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: species, dtype: int64

In [20]:
def func(d):
    print(d)
    a = (df2['species'] == d)
    return a

In [21]:
sp = df2['species'].unique()
print(sp[0])
print(sp[1])
print(sp[2])

Iris-setosa
Iris-versicolor
Iris-virginica

In [22]:
for i in sp:
    a = func(str(i))
    print(df2[a].describe())

Iris-setosa
       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000
Iris-versicolor
       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000
Iris-virginica
       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000

In [23]:
df2.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [24]:
df2.dtypes.value_counts()

float64    4
object     1
dtype: int64